HB9IIU/ESP32_S3_WaveShare-ADSB-Companion/src/main.cpp
// ═════════════════════════════════════════════════════════════════════════════
// main.cpp — ESP32-S3 ESRI World Imagery satellite map display
//
// Hardware
//   Waveshare ESP32-S3-Touch-LCD-7  (800×480 RGB parallel LCD, 8 MB OPI PSRAM,
//   16 MB flash, GT911 capacitive touch, CH422G GPIO expander for backlight)
//
// Software stack
//   LovyanGFX  — RGB-panel driver; single PSRAM framebuffer, continuous DMA
//   LittleFS   — tile scratch file + map snapshot storage
//   FreeRTOS   — underlying RTOS (Arduino loop runs in its own task)
//
// Interaction model (state machine — see InteractionMode enum)
//   Normal   : tap anywhere → open Map Actions menu
//   Menu     : tap a button → save / delete / re-centre / zoom / close
//   Recenter : tap the desired new centre point on the map
//   Zoom     : numeric keypad to enter a new view radius
//
// Key hardware constraint
//   Flash writes on ESP32-S3 temporarily disable the data cache (DCache).
//   This starves the RGB panel's DMA from the PSRAM framebuffer and causes
//   visible flicker.  The backlight is turned off around any flash-write
//   operation (map save, LittleFS open) that lasts more than a few ms.
// ═════════════════════════════════════════════════════════════════════════════

#include <Arduino.h>
#include <LittleFS.h>
#include <esp32-hal-psram.h>
#include "HB9IIUdisplayInit.h"
#if AIRCRAFT_LIVE_DATA
#include "aircraft/aircraft_live.h"
#else
#include "aircraft/aircraft_demo.h"
#endif
#include "boot_manager.h"
#include "fresh_setup.h"
#include "map_snapshot.h"
#include "myconfig.h"
#include "satellite_map.h"
#include "ui/altitude_legend.h"
#include "ui/aircraft_status_banner.h"
#include "ui/aircraft_info_page.h"
#include "ui/aircraft_picture_page.h"
#include "ui/aircraft_statistics_page.h"
#include "ui/home_marker.h"
#include "ui/legend_page.h"
#include "ui/clock_screensaver.h"
#include "screenshot_server.h"

LGFX tft;
#if AIRCRAFT_LIVE_DATA
static AircraftLive::Display aircraftOverlay;
#else
static AircraftDemo::Demo aircraftDemo;
#endif
static AltitudeLegend::Overlay altitudeLegend;
static AircraftStatusBanner::Overlay aircraftStatusBanner;
static AircraftInfoPage::Page aircraftInfoPage;
static AircraftPicturePage::Page aircraftPicturePage;
static AircraftStatisticsPage::Page aircraftStatisticsPage;
static HomeMarker::Overlay homeMarker;

// ═════════════════════════════════════════════════════════════════════════════
// Interaction state machine
// ═════════════════════════════════════════════════════════════════════════════
// Defined before the forward declarations because close_overlay() uses
// InteractionMode as a default parameter type.

enum class InteractionMode {
    Normal,    // idle; tap opens the action menu
    Menu,      // action menu is open; taps are routed to handle_menu_action()
    Zoom,      // zoom dialog is open; taps go to handle_zoom_action()
    Recenter,  // waiting for the user to tap a new map centre
    AircraftInfo, // selected-aircraft information page
    AircraftPicture, // selected-aircraft full-screen picture page
    AircraftStatistics, // receiver statistics page
    ClockScreensaver,  // full-screen clock; loop() short-circuits to ClockScreensaver::update()
};

enum class MenuAction {
    None,      // tap was outside any button
    Save,
    Delete,
    Recenter,
    Zoom,
    Close,
    FitAircraft,
    ToggleInfoBars,
    ToggleTracks,
    SetHome,
    AdsbServer,
    WiFiSettings,
    Legend,
    Screensaver,
};

// ═════════════════════════════════════════════════════════════════════════════
// Forward declarations
// ═════════════════════════════════════════════════════════════════════════════

// Startup helpers
static bool show_splash();
static void show_map_error(const char* message);

// Map rendering
static bool draw_map();
static bool draw_map_dark();
static void mark_selected_point(int32_t x, int32_t y);

// Overlay core (shared by both the action menu and the zoom dialog)
static void close_overlay(InteractionMode nextMode = InteractionMode::Normal);

// Map action menu
static bool open_action_menu();
static void close_action_menu();
static void draw_action_menu();
static void show_status_overlay(const char* title, const char* subtitle, uint32_t color);
static bool save_current_map(bool showProgress = true);
static void handle_menu_action(int32_t x, int32_t y);

// Zoom / radius dialog
static bool open_zoom_dialog();
static void draw_zoom_dialog();
static void handle_zoom_action(int32_t x, int32_t y);

// ═════════════════════════════════════════════════════════════════════════════
// Layout constants
// ═════════════════════════════════════════════════════════════════════════════

// ── Map action menu ───────────────────────────────────────────────────────────
// No title bar. Three rows of buttons, evenly spaced.
// Tap outside the panel to close (no Close button).
//
// Row 1 — map operations  : Save | Delete | Re-center | Zoom        (4 × 150 px)
// Row 2 — view / overlays : Fit  | Info   | Tracks    | Set home    (4 × 150 px)
// Row 3 — settings        : WiFi | ADSB Server | Legend | Screensaver (4 × 150 px)
//
// Vertical spacing: top-pad 30 px, row-gap 30 px, bottom-pad 30 px
// → kMenuH = 3 × 60 + 4 × 30 = 300 px
constexpr int32_t kMenuX        = 70;
constexpr int32_t kMenuY        = 65;
constexpr int32_t kMenuW        = 660;
constexpr int32_t kMenuH        = 300;
constexpr int32_t kButtonH      = 60;

// Rows 1 & 2: 4 equal buttons, 15 px margin, 10 px gap → W = (660 - 30 - 30) / 4 = 150
constexpr int32_t kButtonW      = 150;
constexpr int32_t kButtonGap    = 10;
constexpr int32_t kFirstButtonX = 85;    // kMenuX + 15 px margin
constexpr int32_t kButtonY      = 95;    // kMenuY + 30 px top-pad
constexpr int32_t kWideButtonW  = 150;
constexpr int32_t kWideButtonGap = 10;
constexpr int32_t kFitButtonX   = kFirstButtonX;
constexpr int32_t kInfoButtonX  = kFitButtonX   + kWideButtonW + kWideButtonGap;
constexpr int32_t kTracksButtonX = kInfoButtonX + kWideButtonW + kWideButtonGap;
constexpr int32_t kHomeButtonX  = kTracksButtonX + kWideButtonW + kWideButtonGap;
constexpr int32_t kSecondButtonY = kButtonY + kButtonH + 30;  // 185

// Row 3: four settings buttons (150 px each, 10 px gaps) — flush with rows 1 & 2
constexpr int32_t kThirdButtonY   = kSecondButtonY + kButtonH + 30;  // 275
constexpr int32_t kThirdButtonW   = 150;
constexpr int32_t kThirdButtonGap = 10;
constexpr int32_t kWiFiButtonX    = kFirstButtonX;                                    // 85
constexpr int32_t kAdsbButtonX    = kWiFiButtonX  + kThirdButtonW + kThirdButtonGap; // 245
constexpr int32_t kLegendButtonX  = kAdsbButtonX  + kThirdButtonW + kThirdButtonGap; // 405
constexpr int32_t kSsButtonX      = kLegendButtonX + kThirdButtonW + kThirdButtonGap; // 565

// ── Button colour palette (RGB565) ───────────────────────────────────────────
// All action-menu and zoom-dialog buttons share this palette so the UI has a
// single consistent visual language.  The 3D bevel is achieved with two extra
// lines per button: kBtnHi on top/left (light), kBtnSh on bottom/right (dark).
constexpr uint32_t kBtnFace    = 0x3AD0; // slate-blue face  ~RGB(56,88,128)
constexpr uint32_t kBtnHi      = 0x5BF5; // top/left highlight ~RGB(88,124,168)
constexpr uint32_t kBtnSh      = 0x1968; // bottom/right shadow ~RGB(24,44,64)
constexpr uint32_t kBtnText    = 0xFFFF; // white label text
constexpr uint32_t kBtnDisFace = 0x2967; // disabled face (dark muted)
constexpr uint32_t kBtnDisText = 0x7BD1; // disabled label (medium grey)

// ── Zoom / radius dialog ──────────────────────────────────────────────────────
// Taller panel that fills most of the screen; contains an input field,
// a 3×4 numpad on the left, and three action buttons on the right.
constexpr int32_t kZoomX      = 70;
constexpr int32_t kZoomY      = 35;
constexpr int32_t kZoomW      = 660;
constexpr int32_t kZoomH      = 410;
constexpr int32_t kKeyW       = 92;
constexpr int32_t kKeyH       = 54;
constexpr int32_t kKeyGap     = 10;
constexpr int32_t kKeyStartX  = 105;
constexpr int32_t kKeyStartY  = 178;  // top of numpad row 0

// ═════════════════════════════════════════════════════════════════════════════
// Global state
// ═════════════════════════════════════════════════════════════════════════════

