HB9IIU/ESP32_S3_WaveShare-ADSB-Companion/src/main.cpp
static SatelliteMap::Request  mapRequest;    // parameters for the next/current map
static SatelliteMap::Viewport mapViewport;   // Mercator transform of the displayed map
static bool mapReady          = false;       // true when a valid map is on screen
static bool savedMapAvailable = false;       // true when a snapshot exists in LittleFS
static bool infoBarsVisible      = true;      // top legend + bottom live status
static uint32_t lastActivityMs   = 0;        // millis() of last touch, reset on map restore
static uint32_t screensaverTimeoutMs = 0;   // 0 = disabled; set from NVS in setup()
static double homeLatitude    = HOME_FALLBACK_LAT;
static double homeLongitude   = HOME_FALLBACK_LON;
#if AIRCRAFT_LIVE_DATA
static AircraftLive::Selection selectedAircraft;
#endif

// Touch state — updated every loop() iteration
static bool    touchWasDown = false;
static int32_t touchX       = 0;
static int32_t touchY       = 0;
static uint32_t lastTapMs   = 0;  // millis() of the last processed tap (debounce)

static InteractionMode interactionMode = InteractionMode::Normal;

// Overlay backup — PSRAM buffer holding the map pixels hidden by an overlay.
// Freed and set to nullptr when the overlay is dismissed (close_overlay).
static lgfx::rgb565_t* menuBackup = nullptr;
static int32_t overlayX = 0;
static int32_t overlayY = 0;
static int32_t overlayW = 0;
static int32_t overlayH = 0;

// Zoom dialog input state
static String zoomInput;       // digits typed so far
static bool   zoomUnitKm = false; // true = km, false = m

// ═════════════════════════════════════════════════════════════════════════════
// Entry points
// ═════════════════════════════════════════════════════════════════════════════

void setup() {
    Serial.begin(115200);
    Serial.setTxTimeoutMs(0);  // don't block if no USB-CDC monitor is connected
    delay(500);                // give USB-CDC time to enumerate on the host
    Serial.println("\n=== ESP32-S3 ESRI World Imagery Display ===");

    initTFT();
    Serial.println("TFT initialised.");
#if AIRCRAFT_LIVE_DATA
    aircraftOverlay.begin();
#else
    aircraftDemo.begin();
#endif
    altitudeLegend.begin();
    aircraftStatusBanner.begin();

    // Seed the map request with the compile-time fallback.  These values are
    // overwritten further down by either the saved snapshot or IP geolocation.
    mapRequest.centerLat = MAP_CENTER_LAT;
    mapRequest.centerLon = MAP_CENTER_LON;
    mapRequest.radiusKm  = MAP_RADIUS_KM;
    mapRequest.width     = 800;
    mapRequest.height    = 480;

    // ── Pre-boot LittleFS mount (splash only) ────────────────────────────────
    // Show the splash and keep it visible while BootManager runs through the
    // full network sequence (WiFi, geolocation, NTP).  The map is displayed
    // only after all init functions complete.
    if (!LittleFS.begin(false, "/littlefs", 10, "littlefs")) {
        Serial.println("LittleFS mount failed.");
    } else {
        Serial.println("LittleFS mounted.");
        show_splash();
        LittleFS.end();
    }

    // ── BootManager: WiFi, geolocation, NTP ──────────────────────────────────
    BootManager::run();
    screensaverTimeoutMs = NVSConfig::loadScreensaverTimeout() * 1000UL;
    lastActivityMs = millis();
    ScreenshotServer::begin();

#if AIRCRAFT_LIVE_DATA
    aircraftOverlay.setServerBase(NVSConfig::loadAdsbServer());
#endif

    // Home is a fixed reference, independent from the movable map centre.
    NVSConfig::HomeData home = NVSConfig::loadHome();
    if (!home.valid) {
        const NVSConfig::LocationData loc = NVSConfig::loadLocation();
        home.lat = loc.valid ? static_cast<double>(loc.lat)
                             : HOME_FALLBACK_LAT;
        home.lon = loc.valid ? static_cast<double>(loc.lon)
                             : HOME_FALLBACK_LON;
        NVSConfig::saveHome(home.lat, home.lon);
        home.valid = true;
        Serial.printf("[home] initialized from %s: %.7f, %.7f\n",
                      loc.valid ? "IP geolocation" : "fallback",
                      home.lat, home.lon);
    } else {
        Serial.printf("[home] restored: %.7f, %.7f\n",
                      home.lat, home.lon);
    }
    homeLatitude = home.lat;
    homeLongitude = home.lon;
#if AIRCRAFT_LIVE_DATA
    aircraftOverlay.setHomeLocation(homeLatitude, homeLongitude);
#endif

    // ── Post-boot LittleFS mount (normal operation) ───────────────────────────
    if (!LittleFS.begin(false, "/littlefs", 10, "littlefs")) {
        Serial.println("[map] ERROR: LittleFS remount failed.");
        show_map_error("LittleFS failed");
        return;
    }

    MapSnapshot::Metadata metadata;
    if (MapSnapshot::load(LittleFS, metadata, mapViewport)) {
        // Saved snapshot found — restore its parameters and the stored pixels.
        mapRequest.centerLat = metadata.centerLat;
        mapRequest.centerLon = metadata.centerLon;
        mapRequest.radiusKm  = metadata.radiusKm;
        mapReady             = true;
        savedMapAvailable    = true;
        SatelliteMap::captureBackground();
        Serial.println("[map] restored saved map; tap for actions");

    } else {
        // No saved map — download a fresh one.  Use the IP-geolocated position
        // from NVS if available; otherwise keep the compile-time fallback.
        savedMapAvailable = false;
        const NVSConfig::LocationData loc = NVSConfig::loadLocation();
        if (loc.valid) {
            mapRequest.centerLat = loc.lat;
            mapRequest.centerLon = loc.lon;
            mapRequest.radiusKm  = MAP_GEO_RADIUS_KM;
            Serial.printf("[map] using IP-geolocated centre: lat=%.4f  lon=%.4f  radius=%.0f km\n",
                          loc.lat, loc.lon, static_cast<double>(MAP_GEO_RADIUS_KM));
        }
        if (draw_map()) {
            // Auto-save the first downloaded map so subsequent boots are instant.
            MapSnapshot::save(LittleFS,
                              mapRequest.centerLat, mapRequest.centerLon,
                              mapRequest.radiusKm, mapViewport,
                              [](float) {});
            savedMapAvailable = true;
            Serial.println("[map] first-run map auto-saved");
        }
    }
}

void loop() {
    // ── Clock screensaver short-circuit ──────────────────────────────────────
    if (ClockScreensaver::isActive()) {
        ScreenshotServer::loop();
        if (ClockScreensaver::update()) {
            // dismissed — restore map tiles and resume normal mode
            for (int32_t ry = 0; ry < 480; ry += 64) {
                const int32_t rh = min(64, 480 - ry);
                for (int32_t rx = 0; rx < 800; rx += 64) {
                    const int32_t rw = min(64, 800 - rx);
                    SatelliteMap::restoreBackground(rx, ry, rw, rh);
                }
            }
            interactionMode = InteractionMode::Normal;
            lastActivityMs  = millis();
        }
        return;
    }

    if (mapReady && interactionMode == InteractionMode::Normal) {
#if AIRCRAFT_LIVE_DATA
        // update() returns true only when it actually erased and redrew aircraft.
        // Only then do we need to hide the home dot first (so aircraft erase
        // can't leave stale pixels under it) and put it back on top afterwards.
        const bool aircraftRedrew = aircraftOverlay.update(mapViewport);
        if (aircraftRedrew) homeMarker.hide();
#else
        aircraftDemo.update();
#endif
        homeMarker.show(mapViewport, homeLatitude, homeLongitude);
        if (infoBarsVisible) {
            altitudeLegend.show();
#if AIRCRAFT_LIVE_DATA
            aircraftStatusBanner.show(aircraftOverlay.status());
#endif
        } else {
            altitudeLegend.hide();
            aircraftStatusBanner.hide();
        }
    } else {
        homeMarker.hide();
#if AIRCRAFT_LIVE_DATA
        aircraftOverlay.pause();
#else
        aircraftDemo.pause();
#endif
        altitudeLegend.hide();
        aircraftStatusBanner.hide();
    }

    int32_t x = 0;
    int32_t y = 0;
    const bool touching = tft.getTouch(&x, &y);

    if (touching) {
        // Track last known touch position (clamped to screen bounds).
        touchX       = constrain(x, 0, 799);
        touchY       = constrain(y, 0, 479);
        touchWasDown = true;
        lastActivityMs = millis();
    } else if (touchWasDown) {
        // Finger just lifted — process the tap with a 300 ms debounce to
        // prevent double-triggering from a single physical touch.
        touchWasDown = false;

        if (mapReady && millis() - lastTapMs >= 300) {
            lastTapMs = millis();

            if (interactionMode == InteractionMode::Normal) {
#if AIRCRAFT_LIVE_DATA
                AircraftLive::Selection selection;
                if (aircraftOverlay.selectAt(
                        touchX, touchY, selection)) {
                    selectedAircraft = selection;
                    altitudeLegend.hide();
                    aircraftStatusBanner.hide();
                    homeMarker.hide();
                    aircraftOverlay.pause();
                    if (aircraftInfoPage.open(
                        selection,
                            homeLatitude,
                            homeLongitude)) {
                        interactionMode = InteractionMode::AircraftInfo;
                    }
                } else {
                    homeMarker.hide();
                    aircraftOverlay.pause();
                    open_action_menu();
                }
#else
                aircraftDemo.pause();
                open_action_menu();
#endif

            } else if (interactionMode == InteractionMode::Menu) {
                handle_menu_action(touchX, touchY);

            } else if (interactionMode == InteractionMode::Zoom) {
                handle_zoom_action(touchX, touchY);

