HB9IIU/ESP32_S3_WaveShare-ADSB-Companion/src/main.cpp
            } else if (interactionMode == InteractionMode::Recenter) {
                double newLat = 0.0;
                double newLon = 0.0;
                if (SatelliteMap::screenToLatLon(mapViewport, touchX, touchY,
                                                  newLat, newLon)) {
                    Serial.printf("[touch] screen=%ld,%ld → lat=%.6f  lon=%.6f\n",
                                  static_cast<long>(touchX), static_cast<long>(touchY),
                                  newLat, newLon);

                    mark_selected_point(touchX, touchY);
                    delay(180);  // brief crosshair flash so the user sees the tap

                    const double previousLat = mapRequest.centerLat;
                    const double previousLon = mapRequest.centerLon;
                    mapRequest.centerLat = newLat;
                    mapRequest.centerLon = newLon;
                    interactionMode = InteractionMode::Normal;

                    if (!draw_map_dark()) {
                        // Network error — roll back to the previous position
                        mapRequest.centerLat = previousLat;
                        mapRequest.centerLon = previousLon;
                    }
                }

            } else if (interactionMode == InteractionMode::AircraftInfo) {
                if (aircraftPicturePage.open(selectedAircraft)) {
                    interactionMode = InteractionMode::AircraftPicture;
                }

            } else if (interactionMode == InteractionMode::AircraftPicture) {
                if (aircraftStatisticsPage.open()) {
                    interactionMode = InteractionMode::AircraftStatistics;
                }

            } else if (interactionMode ==
                       InteractionMode::AircraftStatistics) {
                aircraftStatisticsPage.close();
                aircraftPicturePage.close();
                aircraftInfoPage.close();
                interactionMode = InteractionMode::Normal;
            }
        }
    }

    ScreenshotServer::loop();

    // Launch screensaver after idle timeout (only in Normal mode with map ready)
    if (interactionMode == InteractionMode::Normal && mapReady &&
        screensaverTimeoutMs > 0 &&
        millis() - lastActivityMs > screensaverTimeoutMs) {
        ClockScreensaver::open();
        interactionMode = InteractionMode::ClockScreensaver;
    }

    delay(10);
}

// ═════════════════════════════════════════════════════════════════════════════
// Map rendering
// ═════════════════════════════════════════════════════════════════════════════

// Downloads and renders the map defined by mapRequest.
// Sets mapReady = true on success; shows an error screen on failure.
static bool draw_map() {
    altitudeLegend.hide();
    aircraftStatusBanner.hide();
    homeMarker.hide();
#if AIRCRAFT_LIVE_DATA
    aircraftOverlay.pause();
#else
    aircraftDemo.pause();
#endif
    mapReady = false;
    SatelliteMap::Result result =
        SatelliteMap::drawEsriWorldImagery(mapRequest, LittleFS);

    Serial.printf("[map] result=%s  zoom=%u  tiles=%u/%u  bytes=%u  http=%d\n",
                  SatelliteMap::errorToString(result.error),
                  result.zoom, result.tilesDrawn, result.tilesRequested,
                  static_cast<unsigned>(result.bytesWritten), result.httpCode);

    if (!result.ok()) {
        Serial.printf("[map] last URL: %s\n", result.lastUrl.c_str());
        show_map_error(SatelliteMap::errorToString(result.error));
        return false;
    }

    mapViewport      = result.viewport;
    mapReady         = true;
    interactionMode  = InteractionMode::Normal;
    Serial.printf("[map] ready — centre=%.6f,%.6f; tap for actions\n",
                  mapRequest.centerLat, mapRequest.centerLon);
    return true;
}

// Wraps draw_map() with a "screen will go dark" notice and backlight control.
// Used for zoom and re-centre operations where the download may take several
// seconds — showing the notice first sets user expectations.
static bool draw_map_dark() {
    constexpr int32_t kOvX = 150, kOvY = 178, kOvW = 500, kOvH = 124;
    constexpr int32_t kOvCX = kOvX + kOvW / 2;

    tft.fillRoundRect(kOvX, kOvY, kOvW, kOvH, 8, 0x18E3);
    tft.drawRoundRect(kOvX, kOvY, kOvW, kOvH, 8, TFT_WHITE);
    tft.setTextDatum(MC_DATUM);
    tft.setFont(&fonts::DejaVu24);
    tft.setTextColor(TFT_WHITE);
    tft.drawString("Building new map...", kOvCX, kOvY + 42);
    tft.setFont(&fonts::DejaVu18);
    tft.setTextColor(0xC618);
    tft.drawString("Screen will go dark while building.", kOvCX, kOvY + 82);
    tft.setTextDatum(TL_DATUM);

    delay(1200);  // pause so the user can read the message
    display_set_backlight(false);
    const bool ok = draw_map();
    display_set_backlight(true);
    return ok;
}

// Draws a yellow crosshair + circle at the tapped point.
// The caller should delay ~180 ms afterwards to let the user see it.
static void mark_selected_point(int32_t x, int32_t y) {
    constexpr int32_t arm = 10;
    tft.drawCircle(x, y, 7, TFT_YELLOW);
    tft.drawFastHLine(max(0, x - arm),
                      y,
                      min(arm * 2 + 1, 800 - max(0, x - arm)),
                      TFT_YELLOW);
    tft.drawFastVLine(x,
                      max(0, y - arm),
                      min(arm * 2 + 1, 480 - max(0, y - arm)),
                      TFT_YELLOW);
}

// ═════════════════════════════════════════════════════════════════════════════
// Overlay core
// ═════════════════════════════════════════════════════════════════════════════
// Both the action menu and the zoom dialog use the same open/close mechanism:
//   open  — PSRAM-allocate menuBackup, readRect() the covered pixels, draw overlay
//   close — pushImage() the backup back, free PSRAM, set next interaction mode

static bool open_action_menu() {
    if (interactionMode == InteractionMode::Menu) return true;

    overlayX = kMenuX;
    overlayY = kMenuY;
    overlayW = kMenuW;
    overlayH = kMenuH;

