HB9IIU/ESP32_S3_WaveShare-ADSB-Companion/src/main.cpp
    const size_t pixels = static_cast<size_t>(kMenuW) * kMenuH;
    menuBackup = static_cast<lgfx::rgb565_t*>(
        ps_malloc(pixels * sizeof(lgfx::rgb565_t)));
    if (!menuBackup) {
        Serial.println("[menu] ERROR: PSRAM allocation failed");
        return false;
    }

    tft.readRect(overlayX, overlayY, overlayW, overlayH, menuBackup);
    interactionMode = InteractionMode::Menu;
    draw_action_menu();
    return true;
}

static void close_action_menu() {
    close_overlay();
}

static void close_overlay(InteractionMode nextMode) {
    if (!menuBackup) {
        interactionMode = nextMode;
        return;
    }
    tft.pushImage(overlayX, overlayY, overlayW, overlayH, menuBackup);
    free(menuBackup);
    menuBackup = nullptr;
    overlayX   = 0;
    overlayY   = 0;
    overlayW   = 0;
    overlayH   = 0;
    interactionMode = nextMode;
}

// ═════════════════════════════════════════════════════════════════════════════
// Map action menu
// ═════════════════════════════════════════════════════════════════════════════

// Draws a single action button with a 3D bevel effect.
//   disabled — grayed out face and text (used for Delete when no snapshot exists)
//   pressed  — face darkened and bevel inverted; text offset +1 px each axis
//
// The bevel uses four single-pixel lines:
//   top + left  → kBtnHi (lighter, simulates light from top-left)
//   bottom + right → kBtnSh (darker, simulates shadow below)
// Swapping hi/sh when pressed gives a "pushed in" appearance.
static void draw_button(int32_t x, int32_t y, int32_t width,
                        const char* label,
                        bool disabled = false, bool pressed = false) {
    const uint32_t face = disabled ? kBtnDisFace : (pressed ? kBtnSh : kBtnFace);
    tft.fillRoundRect(x, y, width, kButtonH, 6, face);

    if (!disabled) {
        const uint32_t hiC = pressed ? kBtnSh : kBtnHi;
        const uint32_t shC = pressed ? kBtnHi : kBtnSh;
        tft.drawFastHLine(x + 7, y + 2,            width - 14, hiC); // top
        tft.drawFastVLine(x + 2, y + 7,            kButtonH - 14, hiC); // left
        tft.drawFastHLine(x + 7, y + kButtonH - 3, width - 14, shC); // bottom
        tft.drawFastVLine(x + width - 3, y + 7,    kButtonH - 14, shC); // right
    }
    tft.drawRoundRect(x, y, width, kButtonH, 6, kBtnSh); // outer border

    tft.setFont(&fonts::DejaVu18);
    tft.setTextDatum(MC_DATUM);
    tft.setTextColor(disabled ? kBtnDisText : kBtnText);
    tft.drawString(label,
                   x + width / 2 + (pressed ? 1 : 0),
                   y + kButtonH / 2 + (pressed ? 1 : 0));
}

static void draw_action_menu() {
    tft.fillRoundRect(kMenuX, kMenuY, kMenuW, kMenuH, 8, 0x18E3);
    tft.drawRoundRect(kMenuX, kMenuY, kMenuW, kMenuH, 8, TFT_WHITE);

    draw_button(kFirstButtonX, kButtonY, kButtonW, "Save");
    draw_button(kFirstButtonX +   (kButtonW + kButtonGap),
                kButtonY, kButtonW, "Delete", !savedMapAvailable);
    draw_button(kFirstButtonX + 2*(kButtonW + kButtonGap),
                kButtonY, kButtonW, "Re-center");
    draw_button(kFirstButtonX + 3*(kButtonW + kButtonGap),
                kButtonY, kButtonW, "Zoom");
    draw_button(kFitButtonX, kSecondButtonY, kWideButtonW, "Fit aircraft");
    draw_button(kInfoButtonX, kSecondButtonY, kWideButtonW,
                infoBarsVisible ? "Hide info bars" : "Show info bars");
#if AIRCRAFT_LIVE_DATA
    draw_button(kTracksButtonX, kSecondButtonY, kWideButtonW,
                aircraftOverlay.tracksVisible()
                    ? "Hide tracks" : "Show tracks",
                !aircraftOverlay.tracksAvailable());
#else
    draw_button(kTracksButtonX, kSecondButtonY, kWideButtonW,
                "Show tracks", true);
#endif
    draw_button(kHomeButtonX, kSecondButtonY, kWideButtonW,
                "Set home");
    draw_button(kWiFiButtonX,   kThirdButtonY, kThirdButtonW, "WiFi");
    draw_button(kAdsbButtonX,   kThirdButtonY, kThirdButtonW, "ADSB Server");
    draw_button(kLegendButtonX, kThirdButtonY, kThirdButtonW, "Legend");
    {
        const uint32_t ssSec = screensaverTimeoutMs / 1000;
        char ssBuf[16];
        if (ssSec == 0)       snprintf(ssBuf, sizeof(ssBuf), "SS: off");
        else if (ssSec < 60)  snprintf(ssBuf, sizeof(ssBuf), "SS: %us",  ssSec);
        else                   snprintf(ssBuf, sizeof(ssBuf), "SS: %um",  ssSec / 60);
        draw_button(kSsButtonX, kThirdButtonY, kThirdButtonW, ssBuf);
    }
    tft.setTextDatum(TL_DATUM);
}

// Shows a two-line status overlay in the same style as the Save result popup.
static void show_status_overlay(const char* title, const char* subtitle, uint32_t color) {
    constexpr int32_t kOvX = 150, kOvY = 178, kOvW = 500, kOvH = 124;
    constexpr int32_t kOvCX   = kOvX + kOvW / 2;
    constexpr int32_t kLine1Y = kOvY + 42;
    constexpr int32_t kLine2Y = kOvY + 82;

    const size_t ovPixels = static_cast<size_t>(kOvW) * kOvH;
    auto* ovBackup = static_cast<lgfx::rgb565_t*>(
        ps_malloc(ovPixels * sizeof(lgfx::rgb565_t)));
    if (ovBackup) tft.readRect(kOvX, kOvY, kOvW, kOvH, ovBackup);

    tft.fillRoundRect(kOvX, kOvY, kOvW, kOvH, 8, 0x18E3);
    tft.drawRoundRect(kOvX, kOvY, kOvW, kOvH, 8, color);
    tft.setFont(&fonts::DejaVu24);
    tft.setTextDatum(MC_DATUM);
    tft.setTextColor(color);
    tft.drawString(title, kOvCX, kLine1Y);
    tft.setFont(&fonts::DejaVu18);
    tft.setTextColor(0xC618);
    tft.drawString(subtitle, kOvCX, kLine2Y);
    tft.setTextDatum(TL_DATUM);
    delay(900);

    if (ovBackup) {
        tft.pushImage(kOvX, kOvY, kOvW, kOvH, ovBackup);
        free(ovBackup);
    }
}

// Saves the clean map framebuffer and gives visual feedback while flash writes
// temporarily stall the RGB panel's access to PSRAM.
static bool save_current_map(bool showProgress) {
    constexpr int32_t kOvX = 150, kOvY = 178, kOvW = 500, kOvH = 124;
    constexpr int32_t kOvCX = kOvX + kOvW / 2;
    constexpr int32_t kLine1Y = kOvY + 42;
    constexpr int32_t kLine2Y = kOvY + 82;

    const size_t ovPixels = static_cast<size_t>(kOvW) * kOvH;
    auto* ovBackup = static_cast<lgfx::rgb565_t*>(
        ps_malloc(ovPixels * sizeof(lgfx::rgb565_t)));

    bool backlightOff = false;
    bool overlayDrawn = false;

    const bool saved = MapSnapshot::save(
        LittleFS,
        mapRequest.centerLat,
        mapRequest.centerLon,
        mapRequest.radiusKm,
        mapViewport,
        [&](float /*progress*/) {
            if (overlayDrawn) return;
            overlayDrawn = true;
            if (showProgress) {
                if (ovBackup) {
                    tft.readRect(kOvX, kOvY, kOvW, kOvH, ovBackup);
                }
                tft.fillRoundRect(kOvX, kOvY, kOvW, kOvH, 8, 0x18E3);
                tft.drawRoundRect(kOvX, kOvY, kOvW, kOvH, 8, TFT_WHITE);
                tft.setTextDatum(MC_DATUM);
                tft.setFont(&fonts::DejaVu24);
                tft.setTextColor(TFT_WHITE);
                tft.drawString("Saving map...", kOvCX, kLine1Y);
                tft.setFont(&fonts::DejaVu18);
                tft.setTextColor(0xC618);
                tft.drawString("Screen will go dark while saving.", kOvCX, kLine2Y);
                tft.setTextDatum(TL_DATUM);
                delay(1200);
            }
            display_set_backlight(false);
            backlightOff = true;
        });

    if (backlightOff) display_set_backlight(true);

