HB9IIU/ESP32_S3_WaveShare-ADSB-Companion/src/main.cpp
    if (showProgress && overlayDrawn) {
        const uint32_t color = saved ? TFT_WHITE : TFT_RED;
        tft.fillRoundRect(kOvX, kOvY, kOvW, kOvH, 8, 0x18E3);
        tft.drawRoundRect(kOvX, kOvY, kOvW, kOvH, 8, color);
        tft.setFont(&fonts::DejaVu24);
        tft.setTextDatum(MC_DATUM);
        tft.setTextColor(color);
        tft.drawString(saved ? "Map saved" : "Save failed",
                       kOvCX, kLine1Y);
        tft.setFont(&fonts::DejaVu18);
        tft.setTextColor(0xC618);
        tft.drawString(saved ? "Snapshot stored successfully."
                             : "The snapshot could not be stored.",
                       kOvCX, kLine2Y);
        tft.setTextDatum(TL_DATUM);
        delay(900);
    }

    if (showProgress && overlayDrawn && ovBackup) {
        tft.pushImage(kOvX, kOvY, kOvW, kOvH, ovBackup);
    }
    if (ovBackup) free(ovBackup);

    savedMapAvailable = saved || MapSnapshot::exists(LittleFS);
    if (!showProgress && !saved) {
        show_status_overlay("Auto-save failed", "The snapshot could not be stored.", TFT_RED);
    }
    return saved;
}

// Maps a screen tap coordinate to a MenuAction.
static MenuAction menu_action_at(int32_t x, int32_t y) {
    if (y >= kButtonY && y < kButtonY + kButtonH) {
        for (int32_t i = 0; i < 4; i++) {
            const int32_t left = kFirstButtonX + i * (kButtonW + kButtonGap);
            if (x >= left && x < left + kButtonW) {
                return static_cast<MenuAction>(i + 1);
            }
        }
    }
    if (y >= kSecondButtonY && y < kSecondButtonY + kButtonH) {
        if (x >= kFitButtonX && x < kFitButtonX + kWideButtonW) {
            return MenuAction::FitAircraft;
        }
        if (x >= kInfoButtonX && x < kInfoButtonX + kWideButtonW) {
            return MenuAction::ToggleInfoBars;
        }
        if (x >= kTracksButtonX &&
            x < kTracksButtonX + kWideButtonW) {
            return MenuAction::ToggleTracks;
        }
        if (x >= kHomeButtonX &&
            x < kHomeButtonX + kWideButtonW) {
            return MenuAction::SetHome;
        }
    }
    if (y >= kThirdButtonY && y < kThirdButtonY + kButtonH) {
        if (x >= kWiFiButtonX && x < kWiFiButtonX + kThirdButtonW) {
            return MenuAction::WiFiSettings;
        }
        if (x >= kAdsbButtonX && x < kAdsbButtonX + kThirdButtonW) {
            return MenuAction::AdsbServer;
        }
        if (x >= kLegendButtonX && x < kLegendButtonX + kThirdButtonW) {
            return MenuAction::Legend;
        }
        if (x >= kSsButtonX && x < kSsButtonX + kThirdButtonW) {
            return MenuAction::Screensaver;
        }
    }
    return MenuAction::None;
}

static void handle_menu_action(int32_t x, int32_t y) {
    const MenuAction action = menu_action_at(x, y);

    // Tap outside any button but still within the panel → ignore.
    // Tap outside the panel entirely → close the menu.
    if (action == MenuAction::None) {
        if (x < kMenuX || x >= kMenuX + kMenuW ||
            y < kMenuY || y >= kMenuY + kMenuH) {
            close_action_menu();
        }
        return;
    }

    // 90 ms press flash: darken the tapped button briefly before executing.
    // This gives tactile-style feedback without requiring a physical click.
    static const char* kBtnLabels[4] = {
        "Save", "Delete", "Re-center", "Zoom"
    };
    const bool isFitAction         = action == MenuAction::FitAircraft;
    const bool isInfoAction        = action == MenuAction::ToggleInfoBars;
    const bool isTracksAction      = action == MenuAction::ToggleTracks;
    const bool isHomeAction        = action == MenuAction::SetHome;
    const bool isAdsbAction        = action == MenuAction::AdsbServer;
    const bool isWiFiAction        = action == MenuAction::WiFiSettings;
    const bool isLegendAction      = action == MenuAction::Legend;
    const bool isScreensaverAction = action == MenuAction::Screensaver;
    const bool isRow2Action =
        isFitAction || isInfoAction || isTracksAction || isHomeAction;
    const bool isRow3Action =
        isWiFiAction || isAdsbAction || isLegendAction || isScreensaverAction;
    const int32_t btnIdx = static_cast<int32_t>(action) - 1;
    const int32_t btnX = isWiFiAction        ? kWiFiButtonX
        : isAdsbAction        ? kAdsbButtonX
        : isLegendAction      ? kLegendButtonX
        : isScreensaverAction ? kSsButtonX
        : isRow2Action
            ? (isFitAction
                ? kFitButtonX
                : (isInfoAction
                    ? kInfoButtonX
                    : (isTracksAction ? kTracksButtonX : kHomeButtonX)))
            : kFirstButtonX + btnIdx * (kButtonW + kButtonGap);
    const int32_t btnY = isRow3Action ? kThirdButtonY
        : (isRow2Action ? kSecondButtonY : kButtonY);
    const int32_t btnW = isRow3Action ? kThirdButtonW
        : (isRow2Action ? kWideButtonW : kButtonW);
    // For the screensaver button the label is dynamic (shows current timeout).
    char ssBtnBuf[16] = {};
    if (isScreensaverAction) {
        const uint32_t ssSec = screensaverTimeoutMs / 1000;
        if (ssSec == 0)      snprintf(ssBtnBuf, sizeof(ssBtnBuf), "SS: off");
        else if (ssSec < 60) snprintf(ssBtnBuf, sizeof(ssBtnBuf), "SS: %us", ssSec);
        else                  snprintf(ssBtnBuf, sizeof(ssBtnBuf), "SS: %um", ssSec / 60);
    }
    const char* btnLabel = isFitAction
        ? "Fit aircraft"
        : (isInfoAction
            ? (infoBarsVisible ? "Hide info bars" : "Show info bars")
            : (isHomeAction
                ? "Set home"
                : (isAdsbAction
                    ? "ADSB Server"
                    : (isWiFiAction
                    ? "WiFi"
                    : (isLegendAction
                    ? "Legend"
                    : (isScreensaverAction
                    ? ssBtnBuf
                    : (isTracksAction
#if AIRCRAFT_LIVE_DATA
                    ? (aircraftOverlay.tracksVisible()
                        ? "Hide tracks" : "Show tracks")
#else
                    ? "Show tracks"
#endif
                    : kBtnLabels[btnIdx])))))));
    const bool btnDis =
        (action == MenuAction::Delete && !savedMapAvailable)
#if AIRCRAFT_LIVE_DATA
        || (isTracksAction && !aircraftOverlay.tracksAvailable())
#else
        || isTracksAction
#endif
        ;
    draw_button(btnX, btnY, btnW, btnLabel, btnDis, true);
    delay(90);
    draw_button(btnX, btnY, btnW, btnLabel, btnDis, false);

    if (action == MenuAction::ToggleInfoBars) {
        infoBarsVisible = !infoBarsVisible;
        close_action_menu();
        Serial.printf("[ui] info bars %s\n",
                      infoBarsVisible ? "shown" : "hidden");
        return;
    }

    if (action == MenuAction::ToggleTracks) {
#if AIRCRAFT_LIVE_DATA
        if (!aircraftOverlay.tracksAvailable()) return;
        aircraftOverlay.setTracksVisible(
            !aircraftOverlay.tracksVisible());
        close_action_menu();
        Serial.printf("[ui] aircraft tracks %s\n",
                      aircraftOverlay.tracksVisible()
                          ? "shown" : "hidden");
#endif
        return;
    }

