HB9IIU/ESP32_S3_WaveShare-ADSB-Companion/src/main.cpp
    if (action == MenuAction::SetHome) {
        close_action_menu();

        double newHomeLatitude = homeLatitude;
        double newHomeLongitude = homeLongitude;
        if (FreshSetup::promptHome(
                homeLatitude, homeLongitude,
                newHomeLatitude, newHomeLongitude)) {
            homeLatitude = newHomeLatitude;
            homeLongitude = newHomeLongitude;
            NVSConfig::saveHome(homeLatitude, homeLongitude);
#if AIRCRAFT_LIVE_DATA
            aircraftOverlay.setHomeLocation(
                homeLatitude, homeLongitude);
#endif
            Serial.printf(
                "[home] updated from coordinate editor: %.7f, %.7f\n",
                homeLatitude, homeLongitude);
        }

        // The coordinate editor uses LVGL and clears the display on exit.
        // Restore the clean map from PSRAM in supported 64x64 tiles.
        for (int32_t y = 0; y < 480; y += 64) {
            const int32_t height = min(64, 480 - y);
            for (int32_t x = 0; x < 800; x += 64) {
                const int32_t width = min(64, 800 - x);
                SatelliteMap::restoreBackground(
                    x, y, width, height);
            }
        }
        interactionMode = InteractionMode::Normal;
        return;
    }

    if (action == MenuAction::WiFiSettings) {
        close_action_menu();

        char ssid[64] = {0};
        char password[64] = {0};
        if (FreshSetup::promptWiFi(ssid, sizeof(ssid), password, sizeof(password))) {
            NVSConfig::saveWiFi(ssid, password);
            tft.fillScreen(TFT_BLACK);
            tft.setFont(&fonts::DejaVu24);
            tft.setTextDatum(MC_DATUM);
            tft.setTextColor(TFT_WHITE);
            tft.drawString("WiFi updated - rebooting...", 400, 240);
            tft.setTextDatum(TL_DATUM);
            delay(2000);
            ESP.restart();
        }

        // User did not complete the flow — restore the map.
        for (int32_t y = 0; y < 480; y += 64) {
            const int32_t height = min(64, 480 - y);
            for (int32_t x = 0; x < 800; x += 64) {
                const int32_t width = min(64, 800 - x);
                SatelliteMap::restoreBackground(x, y, width, height);
            }
        }
        interactionMode = InteractionMode::Normal;
        return;
    }

    if (action == MenuAction::AdsbServer) {
        close_action_menu();

        char url[128];
        const String current = NVSConfig::loadAdsbServer();
        if (FreshSetup::promptAdsbServer(url, sizeof(url), current.c_str())) {
            NVSConfig::saveAdsbServer(url);
#if AIRCRAFT_LIVE_DATA
            aircraftOverlay.setServerBase(String(url));
#endif
            Serial.printf("[adsb] server base updated: %s\n", url);
        }

        for (int32_t y = 0; y < 480; y += 64) {
            const int32_t height = min(64, 480 - y);
            for (int32_t x = 0; x < 800; x += 64) {
                const int32_t width = min(64, 800 - x);
                SatelliteMap::restoreBackground(x, y, width, height);
            }
        }
        interactionMode = InteractionMode::Normal;
        return;
    }

    if (action == MenuAction::Screensaver) {
        // Cycle through timeout values: off → 10s → 30s → 60s → 5m → 15m → off
        static const uint32_t kTimeouts[] = {0, 10, 30, 60, 300, 900};
        constexpr size_t kCount = sizeof(kTimeouts) / sizeof(kTimeouts[0]);
        const uint32_t curSec = screensaverTimeoutMs / 1000;
        size_t nextIdx = 0;
        for (size_t i = 0; i < kCount; ++i) {
            if (kTimeouts[i] == curSec) { nextIdx = (i + 1) % kCount; break; }
        }
        screensaverTimeoutMs = kTimeouts[nextIdx] * 1000UL;
        NVSConfig::saveScreensaverTimeout(kTimeouts[nextIdx]);
        lastActivityMs = millis();
        Serial.printf("[ss] timeout set to %u s\n", kTimeouts[nextIdx]);
        draw_action_menu();  // redraw to show updated label
        return;
    }

    if (action == MenuAction::Legend) {
        close_action_menu();
        LegendPage::show();
        for (int32_t y = 0; y < 480; y += 64) {
            const int32_t height = min(64, 480 - y);
            for (int32_t x = 0; x < 800; x += 64) {
                const int32_t width = min(64, 800 - x);
                SatelliteMap::restoreBackground(x, y, width, height);
            }
        }
        interactionMode = InteractionMode::Normal;
        return;
    }

    if (action == MenuAction::Recenter) {
        close_action_menu();
        interactionMode = InteractionMode::Recenter;
        // Small hint label at the top of the screen
        tft.fillRoundRect(275, 12, 250, 42, 6, 0x18E3);
        tft.drawRoundRect(275, 12, 250, 42, 6, TFT_YELLOW);
        tft.setFont(&fonts::DejaVu18);
        tft.setTextDatum(MC_DATUM);
        tft.setTextColor(TFT_YELLOW);
        tft.drawString("Tap the new center", 400, 33);
        tft.setTextDatum(TL_DATUM);
        return;
    }

    if (action == MenuAction::Zoom) {
        close_action_menu();
        open_zoom_dialog();
        return;
    }

    if (action == MenuAction::FitAircraft) {
#if AIRCRAFT_LIVE_DATA
        double fittedLat = 0.0;
        double fittedLon = 0.0;
        float fittedRadiusKm = 0.0f;
        size_t fittedAircraft = 0;
        if (!aircraftOverlay.fitMapRequest(
                fittedLat, fittedLon, fittedRadiusKm, fittedAircraft)) {
            close_action_menu();
            show_status_overlay("No live aircraft", "No ADS-B aircraft in range.", TFT_YELLOW);
            return;
        }

        const double previousLat = mapRequest.centerLat;
        const double previousLon = mapRequest.centerLon;
        const float previousRadius = mapRequest.radiusKm;

        close_action_menu();
        mapRequest.centerLat = fittedLat;
        mapRequest.centerLon = fittedLon;
        mapRequest.radiusKm = fittedRadiusKm;
        Serial.printf(
            "[adsb-fit] fitting %u aircraft: center=%.6f,%.6f radius=%.3f km\n",
            static_cast<unsigned>(fittedAircraft),
            fittedLat, fittedLon, fittedRadiusKm);

        if (!draw_map_dark()) {
            mapRequest.centerLat = previousLat;
            mapRequest.centerLon = previousLon;
            mapRequest.radiusKm = previousRadius;
            Serial.println("[adsb-fit] redraw failed — restoring previous map");
            draw_map_dark();
            return;
        }

        save_current_map(false);
#else
        close_action_menu();
        show_status_overlay("Live aircraft disabled", "Built without live data support.", TFT_YELLOW);
#endif
        return;
    }

