HB9IIU/ESP32_S3_WaveShare-ADSB-Companion/src/main.cpp
    // Close the menu before the long-running operations below so the map is
    // fully restored before we capture or overwrite it.
    close_action_menu();

    if (action == MenuAction::Save) {
        save_current_map();
        return;
    }

    if (action == MenuAction::Delete) {
        if (!savedMapAvailable) {
            show_status_overlay("No saved map", "Nothing to remove.", TFT_YELLOW);
            return;
        }
        const bool removed = MapSnapshot::remove(LittleFS);
        savedMapAvailable  = !removed && MapSnapshot::exists(LittleFS);
        show_status_overlay(
            removed ? "Map deleted"   : "Delete failed",
            removed ? "The snapshot has been removed."
                    : "The snapshot could not be removed.",
            removed ? TFT_WHITE : TFT_RED);
    }
}

// ═════════════════════════════════════════════════════════════════════════════
// Zoom / radius dialog
// ═════════════════════════════════════════════════════════════════════════════

// Strips trailing zeros after a decimal point so "50.000" displays as "50",
// and "0.039" stays as "0.039".
static void trim_number(String& value) {
    while (value.indexOf('.') >= 0 && value.endsWith("0")) {
        value.remove(value.length() - 1);
    }
    if (value.endsWith(".")) value.remove(value.length() - 1);
    if (value.length() == 0) value = "0";
}

static String format_radius_value(float value) {
    String result(value, value < 10.0f ? 3 : 1);
    trim_number(result);
    return result;
}

static bool open_zoom_dialog() {
    if (interactionMode == InteractionMode::Zoom) return true;

    overlayX = kZoomX;
    overlayY = kZoomY;
    overlayW = kZoomW;
    overlayH = kZoomH;

    const size_t pixels = static_cast<size_t>(overlayW) * overlayH;
    menuBackup = static_cast<lgfx::rgb565_t*>(
        ps_malloc(pixels * sizeof(lgfx::rgb565_t)));
    if (!menuBackup) {
        Serial.println("[zoom] ERROR: PSRAM allocation failed");
        interactionMode = InteractionMode::Normal;
        return false;
    }

    tft.readRect(overlayX, overlayY, overlayW, overlayH, menuBackup);

    // Initialise the input field with the current radius in whichever unit
    // makes more sense (km for ≥ 1 km, metres otherwise).
    zoomUnitKm = mapRequest.radiusKm >= 1.0f;
    const float displayedValue =
        zoomUnitKm ? mapRequest.radiusKm : mapRequest.radiusKm * 1000.0f;
    zoomInput = format_radius_value(displayedValue);

    interactionMode = InteractionMode::Zoom;
    draw_zoom_dialog();
    return true;
}

// Draws a single key in the numpad or action row using the same 3D bevel style
// as the action-menu buttons (shared kBtn* palette).
static void draw_zoom_key(int32_t x, int32_t y, int32_t width, int32_t height,
                          const char* label, bool pressed = false) {
    const uint32_t face = pressed ? kBtnSh : kBtnFace;
    tft.fillRoundRect(x, y, width, height, 6, face);

    const uint32_t hiC = pressed ? kBtnSh : kBtnHi;
    const uint32_t shC = pressed ? kBtnHi : kBtnSh;
    tft.drawFastHLine(x + 7, y + 2,           width  - 14, hiC);
    tft.drawFastVLine(x + 2, y + 7,           height - 14, hiC);
    tft.drawFastHLine(x + 7, y + height - 3,  width  - 14, shC);
    tft.drawFastVLine(x + width - 3, y + 7,   height - 14, shC);
    tft.drawRoundRect(x, y, width, height, 6, kBtnSh);

    tft.setFont(&fonts::DejaVu18);
    tft.setTextDatum(MC_DATUM);
    tft.setTextColor(kBtnText);
    tft.drawString(label,
                   x + width  / 2 + (pressed ? 1 : 0),
                   y + height / 2 + (pressed ? 1 : 0));
}

static void draw_zoom_dialog() {
    tft.fillRoundRect(kZoomX, kZoomY, kZoomW, kZoomH, 8, 0x18E3);
    tft.drawRoundRect(kZoomX, kZoomY, kZoomW, kZoomH, 8, TFT_WHITE);

    tft.setFont(&fonts::DejaVu24);
    tft.setTextDatum(MC_DATUM);
    tft.setTextColor(TFT_WHITE);
    tft.drawString("Map radius", 400, 68);

    // ── Value display + unit toggle ───────────────────────────────────────────
    tft.fillRoundRect(105, 93, 430, 65, 6, TFT_BLACK);
    tft.drawRoundRect(105, 93, 430, 65, 6, TFT_WHITE);
    tft.setFont(&fonts::DejaVu24);
    tft.setTextColor(TFT_WHITE);
    tft.drawString(zoomInput, 320, 125);
    draw_zoom_key(550, 93, 145, 65, zoomUnitKm ? "km" : "m");

    // ── 3 × 4 numpad ─────────────────────────────────────────────────────────
    static const char* keys[12] = {
        "1", "2", "3",
        "4", "5", "6",
        "7", "8", "9",
        ".", "0", "<"
    };
    for (int32_t i = 0; i < 12; i++) {
        const int32_t col = i % 3;
        const int32_t row = i / 3;
        draw_zoom_key(kKeyStartX + col * (kKeyW + kKeyGap),
                      kKeyStartY + row * (kKeyH + 8),
                      kKeyW, kKeyH, keys[i]);
    }

    // ── Action buttons (right column, aligned with numpad top) ───────────────
    draw_zoom_key(435, 178, 230, 62, "Apply");
    draw_zoom_key(435, 250, 230, 62, "Clear");
    draw_zoom_key(435, 322, 230, 62, "Cancel");

    tft.setTextDatum(TL_DATUM);
}

// Returns true if screen point (x, y) is within the rectangle
// (left, top, width, height).
static bool point_in_rect(int32_t x, int32_t y,
                           int32_t left, int32_t top,
                           int32_t width, int32_t height) {
    return x >= left && x < left + width &&
           y >= top  && y < top  + height;
}

static void handle_zoom_action(int32_t x, int32_t y) {

    // ── Unit toggle (km ↔ m) ──────────────────────────────────────────────────
    if (point_in_rect(x, y, 550, 93, 145, 65)) {
        draw_zoom_key(550, 93, 145, 65, zoomUnitKm ? "km" : "m", true);
        delay(90);
        float value = zoomInput.toFloat();
        if (value <= 0.0f) {
            // Guard against toggling when the field is empty or "Invalid"
            value = zoomUnitKm ? mapRequest.radiusKm : mapRequest.radiusKm * 1000.0f;
        }
        value      = zoomUnitKm ? value * 1000.0f : value / 1000.0f;
        zoomUnitKm = !zoomUnitKm;
        zoomInput  = format_radius_value(value);
        draw_zoom_dialog();
        return;
    }

    // ── Cancel ────────────────────────────────────────────────────────────────
    if (point_in_rect(x, y, 435, 322, 230, 62)) {
        draw_zoom_key(435, 322, 230, 62, "Cancel", true);
        delay(90);
        close_overlay();
        return;
    }

    // ── Clear ─────────────────────────────────────────────────────────────────
    if (point_in_rect(x, y, 435, 250, 230, 62)) {
        draw_zoom_key(435, 250, 230, 62, "Clear", true);
        delay(90);
        zoomInput = "";
        draw_zoom_dialog();
        return;
    }

    // ── Apply ─────────────────────────────────────────────────────────────────
    if (point_in_rect(x, y, 435, 178, 230, 62)) {
        draw_zoom_key(435, 178, 230, 62, "Apply", true);
        delay(90);

        const float entered     = zoomInput.toFloat();
        const float newRadiusKm = zoomUnitKm ? entered : entered / 1000.0f;

