HB9IIU/ESP32_S3_WaveShare-ADSB-Companion/src/main.cpp
        if (entered <= 0.0f || newRadiusKm < 0.001f || newRadiusKm > 5000.0f) {
            zoomInput = "Invalid";
            draw_zoom_dialog();
            delay(650);
            const float displayedValue =
                zoomUnitKm ? mapRequest.radiusKm : mapRequest.radiusKm * 1000.0f;
            zoomInput = format_radius_value(displayedValue);
            draw_zoom_dialog();
            return;
        }

        const float previousRadius = mapRequest.radiusKm;
        close_overlay();
        mapRequest.radiusKm = newRadiusKm;
        Serial.printf("[zoom] radius %.3f → %.3f km\n", previousRadius, mapRequest.radiusKm);

        if (!draw_map_dark()) {
            // Download failed — restore the previous radius and try again so
            // the user sees the old map rather than an error screen.
            mapRequest.radiusKm = previousRadius;
            Serial.println("[zoom] redraw failed — restoring previous radius");
            draw_map_dark();
        }
        return;
    }

    // ── Digit / decimal / backspace keys ──────────────────────────────────────
    static const char* keys[12] = {
        "1", "2", "3",
        "4", "5", "6",
        "7", "8", "9",
        ".", "0", "<"
    };
    for (int32_t i = 0; i < 12; i++) {
        const int32_t col  = i % 3;
        const int32_t row  = i / 3;
        const int32_t keyX = kKeyStartX + col * (kKeyW + kKeyGap);
        const int32_t keyY = kKeyStartY + row * (kKeyH + 8);
        if (!point_in_rect(x, y, keyX, keyY, kKeyW, kKeyH)) continue;

        const String key = keys[i];
        if (key == "<") {
            if (zoomInput.length() > 0) zoomInput.remove(zoomInput.length() - 1);
        } else if (key == ".") {
            if (zoomInput.indexOf('.') < 0 && zoomInput.length() < 9) {
                if (zoomInput.length() == 0) zoomInput = "0";
                zoomInput += ".";
            }
        } else if (zoomInput.length() < 9) {
            if (zoomInput == "0" || zoomInput == "Invalid") zoomInput = "";
            zoomInput += key;
        }
        draw_zoom_dialog();
        return;
    }
}

// ═════════════════════════════════════════════════════════════════════════════
// Startup helpers
// ═════════════════════════════════════════════════════════════════════════════

// Displays the ADS-B splash from LittleFS.  The previous generic splash is
// retained as a fallback so a filesystem built without the new asset still
// starts cleanly.
static bool show_splash() {
    constexpr const char* kPrimarySplash = "/splash_adsb_800x480.jpg";
    constexpr const char* kFallbackSplash = "/splash.jpg";

    Serial.println("[splash] Listing LittleFS root:");
    File root = LittleFS.open("/");
    File f    = root.openNextFile();
    while (f) {
        Serial.printf("  %s  (%u bytes)\n", f.name(), f.size());
        f = root.openNextFile();
    }

    const char* splashPath = LittleFS.exists(kPrimarySplash)
                                 ? kPrimarySplash
                                 : kFallbackSplash;
    if (!LittleFS.exists(splashPath)) {
        Serial.println("[splash] ERROR: no splash image found.");
        return false;
    }
    Serial.printf("[splash] %s found — decoding…\n", splashPath);
    const bool ok =
        tft.drawJpgFile(LittleFS, splashPath, 0, 0, 800, 480);
    Serial.printf("[splash] drawJpgFile: %s\n", ok ? "OK" : "FAILED");
    return ok;
}

// Shows a full-screen error message when the map fails to load.
static void show_map_error(const char* message) {
    tft.fillScreen(TFT_BLACK);
    tft.setFont(&fonts::DejaVu24);
    tft.setTextDatum(MC_DATUM);
    tft.setTextColor(TFT_RED);
    tft.drawString("Map failed", 400, 210);
    tft.setFont(&fonts::DejaVu18);
    tft.setTextColor(TFT_WHITE);
    tft.drawString(message ? message : "unknown error", 400, 270);
    tft.setTextDatum(TL_DATUM);
}
